app/controllers/beers_controller.rb

  def index
    render json: Beer.all.order(created_at: :desc)
---
SELECT "beers".* FROM "beers" ORDER BY "beers"."created_at" DESC

  def create
    @beer = Beer.new(beers_params)

    if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["brewery_id", 5], ["created_at", Wed, 05 Feb 2014 01:55:19 UTC +00:00], ["description", "Super Hoppy"], ["name", "60 Minute"], ["updated_at", Wed, 05 Feb 2014 01:55:19 UTC +00:00]]

  def destroy
    Beer.find(params[:id]).destroy
---
DELETE FROM "beers" WHERE "beers"."id" = $1  [["id", 32]]
SELECT "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT 1  [["id", "32"]]