app/controllers/breweries_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def index
    render json: Brewery.all